Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/sex_offenders_treatment_programmes.html.txt.tmx
Source language: en
Languages: ga

source: Sex offenders treatment programmes
ga: Cláir Chóireála do Chiontóirí Gnéis

source: In April 2009, the Sex Offender Management Policy – Reducing Re-offending, Enhancing Public Safety (pdf) was announced
ga: In Aibreán, foilsíodh an Beartas Bainistíochta Ciontóirí Gnéis – Athchiontú a Laghdú, Sábháilteacht an Phobail a Fheabhsú (pdf)

source: It concerns therapeutic interventions with sex offenders while they are in prison
ga: Baineann sé le hidirghabháil theiripeach le ciontóirí gnéis fad a bhíonn siad i bpríosún

source: The policy is aimed at bringing about changes in offenders' lives that reduce the risk of re-offending
ga: Tá an beartas dírithe ar athruithe a dhéanamh ar shaol na gciontóirí a laghdaíonn an baol go ndéanfaidh siad athchiontú

source: Some of the initiatives announced had already been introduced
ga: Bhí cuid de na tionscnaimh a fógraíodh tugtha isteach cheana féin

source: Under the policy Arbour Hill Prison is designated as the national centre for imprisoned sex offenders with a full range of therapeutic interventions available
ga: Faoin mbeartas, tá Príosún Chnoc an Arbhair ainmnithe mar an t-ionad náisiúnta do chiontóirí gnéis atá i bpríosún, agus tá réimse iomlán d’idirghabháil theiripeach ar fáil

source: Midlands Prison and Wheatfield Place of Detention are designated as satellite centres where a narrower range of therapeutic interventions are available
ga: Tá an Príosún Lár Tíre agus Áit Choinneála Pháirc na Cruithneachta ainmnithe mar ionaid satailíte, áit nach bhfuil réimse chomh fairsing céanna d’idirghabháil theiripeach ar fáil

source: Prisoners committed initially to other prisons are transferred to the satellite centres unless exceptional circumstances prevail
ga: Déantar príosúnaigh a cuireadh go príosúin eile ar dtús a aistriú chuig na hionaid satailíte mura bhfuil cúinsí eisceachtúla ag baint leis an gcás

source: There is a range of therapeutic interventions
ga: Tá réimse d’idirghabháil theiripeach ann

source: Sex offenders are assessed soon after committal and this assessment influences all subsequent therapeutic interventions
ga: Déantar measúnú ar chiontóirí gnéis go gairid i ndiaidh a gcimithe agus imríonn an measúnú seo tionchar ar gach idirghabháil theiripeach ina dhiaidh sin

source: Re-assessment can take place during the sentence, where appropriate
ga: Is féidir athmheasúnú a dhéanamh i rith na pianbhreithe, sa chás gur cuí

source: Individual therapeutic work serves a number of functions, including:
ga: Comhlíonann obair theiripeach aonair roinnt feidhmeanna, ina measc:

source: • Support for offenders in their early commitment to change
ga: • Tacaíocht le ciontóirí go luath i ndiaidh dóibh tiomantas a thabhairt d’athrú

source: • Support for the integration and extension of progress made in group work
ga: • Tacaíocht chun dul chun cinn a rinneadh i ngrúpoibre a chomhtháthú agus a mhéadú

source: • Addressing the risks and needs of offenders who are unable to undertake group programmes
ga: • Dul i ngleic le rioscaí agus riachtanais chiontóirí nach féidir leo tabhairt faoi chláir do ghrúpaí

source: Offence-related therapeutic group interventions
ga: Idirghabháil theiripeach do ghrúpaí a bhaineann leis an gcion

source: The Building Better Lives sex offender programme started in 2009. It is made up of 3 components:
ga: Tá trí chomhábhar sa chlár do chiontóirí gnéis, Saol Níos Fearr a Shaothrú (‘Building Better Lives’), a tosaíodh in 2009:

source: • The Exploring Better Lives programme aims to develop motivation and confidence about positive change
ga: • Tá sé de chuspóir ag an gclár Saol Níos Fearr a Shaothrú spreagadh agus muinín a fhorbairt maidir le hathrú dearfach

source: • The Practising Better Lives programme focuses on obtaining a more detailed understanding of past offending and developing positive offence-free self-management plans for the future
ga: • Díríonn an clár Saol Níos Fearr a Chleachtadh (‘Practising Better Lives’) ar thuiscint níos mionsonraithe a fháil ar chiontú a rinneadh roimhe seo agus ar phleananna féinbhainistithe saor ó chionta a fhorbairt don todhchaí

source: • The Maintaining Better Lives programme aims to support ongoing progress and development for men who are serving longer sentences in prison and to ensure a throughcare plan from prison to community-based supports
ga: • Tá sé de chuspóir ag an gclár Saol Níos Fearr a Chothú (‘Maintaining Better Lives’) chun tacú le dul chun cinn agus le forbairt leanúnach d’fhir a bhfuil pianbhreitheanna níos faide á gcaitheamh acu sa phríosún agus lena chinntiú go bhfuil plean tréchúraim ann san aistriú ón bpríosún go dtí tacaíochtaí pobalbhunaithe

source: In-reach services uses the potential of community-based services to provide interventions within the prison environment
ga: Baineann seirbhísí ion-rochtana leas as acmhainn seirbhísí pobalbhunaithe chun idirghabháil a sholáthar laistigh de thimpeallacht an phríosúin

source: An example is the motivational enhancement groups operated by the Granada Institute in the Midlands and Wheatfield prisons
ga: Sampla de seo is ea na grúpaí um fheabhsú spreagtha a oibríonn Institiúid Granada sa Phríosún Lár Tíre agus i bPríosún Pháirc na Cruithneachta

source: The purpose of the motivational intervention is to help participants explore the potential benefits of therapeutic engagement
ga: Is é cuspóir na hidirghabhála spreagthaí ná chun cabhrú le rannpháirtithe chun na tairbhí féideartha a bhaineann le rannpháirtíocht theiripeach a fhiosrú

source: Further information on the management of sex offenders in prison is available from the Irish Prison Service. Irish Prison Service IDA Business Park Ballinalee Road Longford Co. Longford Ireland Tel:(043) 333 5100 Fax:(043) 333 5371 Homepage: http://www.irishprisons.ie Email: info@irishprisons.ie Department of Justice and Equality 94 St
ga: Tá fáil ar thuilleadh faisnéise ar bhainistiú ciontóirí gnéis i bpríosún ó Sheirbhís Príosún na hÉireann
